{
	"@metadata": {
		"authors": [
			"Addshore",
			"Liuxinyu970226"
		]
	},
	"fileimporter": "FileImporter",
	"fileimporter-desc": "{{desc|name=FileImporter|url=https://www.mediawiki.org/wiki/Extension:FileImporter}}",
	"fileimporter-specialpage": "Title for the File Import special page.",
	"fileimporter-specialpage-successtitle": "Title for the File Import special page upon successful import of a file.",
	"fileimporter-cantparseurl": "Error message shown on the special page when the URL entered can not be parsed.",
	"fileimporter-cantimporturl": "Error message shown on the special page when the URL entered can not be imported from.",
	"fileimporter-localtitleexists": "Error message shown on the special page when the title to be imported to already exists on the local wiki.",
	"fileimporter-duplicatefilesdetected": "Error message shown on the special page when the file to be imported has been detected as already existing on the local wiki.",
	"fileimporter-duplicatefilesdetected-prefix": "Prefix for the duplicate file that has been found.\n{{Identical|Duplicate}}",
	"fileimporter-exampleprefix": "Prefix for the example URL contained within the URL text box on the special page.\n{{Identical|Example}}",
	"fileimporter-textrevisions": "Prefix for the number of text revisions to be imported on the special page.",
	"fileimporter-submit": "Text for the submit button on the special page.\n{{Identical|Submit}}",
	"fileimporter-resubmit": "Text for the resubmit button on the special page.",
	"fileimporter-import": "Text for the import button on the special page.\n{{Identical|Import}}",
	"fileimporter-cancel": "Text for the cancel button on the special page.",
	"fileimporter-imported": "Note shown at the top of the successful import page.",
	"fileimporter-edittitle": "Text for the button allowing a user to edit the file title for import.",
	"fileimporter-editinfo": "Text for the button allowing a user to edit the file info for import.",
	"fileimporter-newtitle": "Label for the new title input box.",
	"fileimporter-editsummary": "Label for the edit summary input box.",
	"fileimporter-editsummary-placeholder": "Placeholder for the edit summary input box.",
	"fileimporter-previewnote": "Note shown at the top of the import page.",
	"fileimporter-heading-fileinfo": "Heading of the file info on the import page.",
	"fileimporter-heading-filehistory": "Heading of the file history on the import page."
}
