{
	"@metadata": {
		"authors": [
			"Adamw",
			"Addshore",
			"Amire80",
			"Liuxinyu970226",
			"Robby",
			"TMg",
			"Tacsipacsi",
			"Umherirrender"
		]
	},
	"fileimporter": "{{name}}",
	"fileimporter-desc": "{{desc|name=FileImporter|url=https://www.mediawiki.org/wiki/Extension:FileImporter}}",
	"fileimporter-help-banner-text": "Wikitext for the help banner.",
	"fileimporter-help-banner-close-tooltip": "Label for the close button shown on the help banner.",
	"tag-fileimporter": "Short label for edits marked with the \"fileimporter\" tag.",
	"tag-fileimporter-description": "Description explaining the \"fileimporter\" tag.",
	"tag-fileimporter-imported": "Short label for edits marked with the \"fileimporter-imported\" tag.",
	"tag-fileimporter-imported-description": "Description explaining the \"fileimporter-imported\" tag.",
	"fileimporter-specialpage": "Title for the File Import special page.",
	"fileimporter-importfailed": "Error message for cases where when a generic import failure occurs.",
	"fileimporter-mediawiki-api-notfound": "Error message when the remote API cannot be found.",
	"fileimporter-api-badinfo": "Error message when the remote API returns bad image or revision info.",
	"fileimporter-api-failedtogetinfo": "Error message when the retrieval of information from the remote API fails.\n* $1 – the request URL",
	"fileimporter-api-nopagesreturned": "Error message when the remote API returns no pages.",
	"fileimporter-api-toomanyrevisions": "Error message when the import target has too many revisions.",
	"fileimporter-api-file-notfound": "Error message when the API is reachable but the image is not found.\n\nParameters:\n* $1 - the URL of the nonexisting image",
	"fileimporter-api-failedtofindapi": "Error message when the API is not reachable.\n\nParameters:\n* $1 - URL of the image\n* $2 - HTTP status code, if available\n* $3 - original API error message, if available.",
	"fileimporter-http-statuscode": "Error message containing the status code of failed request.\n\nParameters:\n* $1 - the actual status code",
	"fileimporter-cantparseurl": "Error message for cases where when the URL entered can not be parsed.",
	"fileimporter-cantimporturl": "Error message for cases where when the URL entered can not be imported from.",
	"fileimporter-cantimportfromsharedrepo": "Error message when the file import target comes from a shared or remote repository.\n\nParameters:\n* $1 - domain name that doesn't actually host the file",
	"fileimporter-cantimportmissingfile": "Error message when the file import target is missing.",
	"fileimporter-cantimportfilehidden": "Error message when the file contains at least one hidden file revision.",
	"fileimporter-cantimportfileinvalid": "Error message when the file contains at least one revision which fails a MediaWiki security check.\n\nParameters:\n* $1 - original MediaWiki error message.",
	"fileimporter-warningabusefilter": "Warning message when the file contains at least one revision which causes an AbuseFilter warning.",
	"fileimporter-badnamespace": "Error message when attempting to import from outside of the {{ns:file}} namespace.",
	"fileimporter-badtoken": "Error message for cases where when the CSRF token for the request does not match the expected token.",
	"fileimporter-badimporthash": "Error message for cases where when the import hash for the request does not match the expected hash.",
	"fileimporter-filenameerror-default": "Error message for cases where when the file name to be imported to has an issue we have no special handling for.",
	"fileimporter-filenameerror-illegal": "Error message for cases where when the file name to be imported to is reported as invalid by MediaWiki.",
	"fileimporter-filenameerror-toolong": "Error message for cases where when the file name to be imported to is reported as too long by MediaWiki.",
	"fileimporter-filenameerror-notallowed": "Error message when uploading a file with an extension that's not allowed on the destination wiki.\n\nParameters:\n* $1 - the disallowed extension\n* $2 - list of allowed extensions.",
	"fileimporter-filenameerror-automaticchanges": "Error message for cases where when the file name will be automatically changed by MediaWiki due to having invalid characters.\n\nParameters:\n* $1 - the original file name\n* $2 - the automatically corrected file name",
	"fileimporter-filenameerror-nosourceextension": "Error message for cases where the file provided by the user does not have a file extension.",
	"fileimporter-filenameerror-noplannedextension": "Error message for cases where the planned import name provided by the user does not have a file extension.",
	"fileimporter-filenameerror-missmatchextension": "Error message for cases where the original and planned importer name file extensions do not match.",
	"fileimporter-filenameerror-protected": "Error message for cases where when the file name to be imported to is reported as protected by MediaWiki.",
	"fileimporter-localtitleexists": "Error message for cases where when the file name to be imported to already exists on the local wiki.",
	"fileimporter-sourcetitleexists": "Error message for situations in which the user wants to import a file with a modified file name, but another file with the requested file name also exists on the source wiki. Such an attempt gets blocked with this error message so the other file can still be imported with its original file name.",
	"fileimporter-illegalfilenamechars": "Error message for cases where when the file name to be imported to contains invalid characters as defined by MediaWiki.",
	"fileimporter-duplicatefilesdetected": "Error message for cases where when the file to be imported has been detected as already existing on the local wiki.",
	"fileimporter-duplicatefilesdetected-prefix": "Prefix for the duplicate file that has been found.\n{{Identical|Duplicate}}",
	"fileimporter-exampleprefix": "Prefix for the example URL contained within the URL text box on the special page.\n{{Identical|Example}}",
	"fileimporter-textrevisions": "Prefix for the number of text revisions to be imported on the special page.\n\nParameters:\n* $1 - number of text revisions that will be imported\n* $2 - number of text revisions in source, could be used with PLURAL",
	"fileimporter-filerevisions": "Prefix for the number of file revisions to be imported on the special page.\n\nParameters:\n* $1 - number of file revisions that will be imported\n* $2 - number of file revisions in source, could be used with PLURAL",
	"fileimporter-submit": "Text for the submit button on the special page.\n{{Identical|Submit}}",
	"fileimporter-submit-fileinfo": "Text for the submit button to change the file info text.",
	"fileimporter-submit-title": "Text for the submit button to change the title of the file.",
	"fileimporter-resubmit": "Text for the resubmit button on the special page.",
	"fileimporter-import": "Text for the import button on the special page.\n{{Identical|Import}}",
	"fileimporter-cancel": "Text for the cancel button on the special page.\n{{Identical|Cancel}}",
	"fileimporter-edittitle": "Text for the button allowing a user to edit the file title for import.",
	"fileimporter-editinfo": "Text for the button allowing a user to edit the file info for import.",
	"fileimporter-extensionlabel": "Label for the display of the file extension.",
	"fileimporter-newfilename": "Label for the new file name input box.",
	"fileimporter-editsummary": "Label for the edit summary input box.\n{{Identical|Edit summary}}",
	"fileimporter-previewnote": "Note shown at the top of the import page.",
	"fileimporter-heading-fileinfo": "Heading of the file info on the import page.",
	"fileimporter-heading-filehistory": "Heading of the file history on the import page.",
	"fileimporter-heading-cleanup": "Heading of the clean up source wiki section on the import page.",
	"fileimporter-cleanup-text": "Text to be added to the clean up source wiki section on the import page when an appropriate template is known.\n\nParameters:\n* $1 - Template name for the file on the source wiki.",
	"fileimporter-cleanup-checkboxlabel": "Text for the checkbox that specifies whether to automatically add a template to the source file.",
	"fileimporter-cleanup-summary": "Text for the summary line of the automated edit on the source wiki.\n\nParameters:\n* $1 - URL linking to the new file on the destination wiki.",
	"fileimporter-cleanup-failed": "Text shown when an import was completed but the automated edit on the source wiki failed.",
	"fileimporter-delete-text": "Text to describe the automated source wiki file deletion option.",
	"fileimporter-delete-checkboxlabel": "Text for the checkbox label that specifies whether to automatically delete the source file.",
	"fileimporter-delete-summary": "File summary line used when deleting source wiki file automatically.\n\nParameters:\n* $1 - URL linking to the new file on the destination wiki.",
	"fileimporter-delete-failed": "Warning shown when the automated source wiki deletion fails.\n\nParameters:\n* $1 - Source wiki name\n* $2 - Target file URL.",
	"fileimporter-post-import-revision-annotation": "{{notranslate}}\nExtra text to add to the file info page after importing. This will only be rendered using the target wiki's content language.\n\nParameters:\n* $1 - Full URL to the imported file on the source wiki.\n* $2 - Time of import, as ISO 8601.",
	"fileimporter-revision-removed-text": "Text inserted if the original text is hidden.",
	"fileimporter-revision-removed-comment": "Text inserted as a revision comment if the original comment is hidden.",
	"fileimporter-filemissinginrevision": "Error message shown when the file contains at least one revision with a missing image file.",
	"fileimporter-filetoolarge": "Text shown when a user tries to import a file with a history of one or more file versions that exceed the maximum file size limit.\n\nParameters:\n* $1 - Number of file revisions to be imported, could be used with PLURAL",
	"fileimporter-import-wait": "Text shown during the file preview informing the user that the import may take a few minutes.",
	"fileimporter-imported-success-banner": "Text shown when an import was completed successfully which includes a link to the file's new location.",
	"fileimporter-add-unknown-template": "Suggested action on the success screen, for marking the source wiki file when a \"NowCommons\" template is unavailable.\n\nParameters:\n* $1 - Link to the original file.",
	"fileimporter-add-specific-template": "Suggested action on the success screen, for marking the source wiki file when the \"NowCommons\" template is known.\n\nParameters:\n* $1 - Link to the original file.\n* $2 - Suggested template name on the source wiki.\n* $3 - New file name on the target wiki.",
	"fileimporter-go-to-original-file-button": "Text for the button linking back to the original file shown on both the success and error screen.",
	"fileimporter-commonshelper-retrieval-failed": "Error message shown when checking for blocked categories or templates fails.",
	"fileimporter-commonshelper-missing-config": "Error message shown when the configuration page, used to prevent the import of files with bad categories or templates, is missing.\n\nParameters:\n* $1 - Source wiki hostname (not the name of the configuration page)\n* $2 - Link to the configuration root path",
	"fileimporter-commonshelper-parsing-failed": "Error message shown when the configuration page, used to prevent the import of files with bad categories/templates, is incomplete.\n\nParameters:\n* $1 - Configuration file url.\n* $2 - Name of the section missing from the configuration page.",
	"fileimporter-file-contains-blocked-category-template": "Error message shown when the file contains a blocked category/template.\n\nParameters:\n* $1 - Blocked category/template name.",
	"fileimporter-file-missing-required-template": "Error message shown when the file is missing a template (license template) required to import the file.",
	"fileimporter-category-encouragement": "Message shown near the category box while importing, which encourages the user to include categories.",
	"fileimporter-auto-replacements-summary": "Automatic summary line protocolling how many automatic changes have been done.\n\nParameters:\n* $1 - Number of changes done, could be used with PLURAL.",
	"fileimporter-input-page-info-text": "Message shown to the user when visiting the URL input page.",
	"fileimporter-viewdiff": "Text for the show changes button on the special page.\n{{Identical|Show changes}}",
	"fileimporter-to-preview": "Text for the button on the diff page to get back to the preview."
}
