{
	"@metadata": {
		"authors": [
			"Addshore",
			"Liuxinyu970226",
			"Robby"
		]
	},
	"fileimporter": "FileImporter",
	"fileimporter-desc": "{{desc|name=FileImporter|url=https://www.mediawiki.org/wiki/Extension:FileImporter}}",
	"fileimporter-specialpage": "Title for the File Import special page.",
	"fileimporter-specialpage-successtitle": "Title for the File Import special page upon successful import of a file.",
	"fileimporter-importfailed": "Error message shown on the special page when a generic import failure occurs.",
	"fileimporter-api-badinfo": "Error message when the remote API returns bad image or revision info.",
	"fileimporter-api-failedtogetinfo": "Error message when the retrieval of information from the remote API fails.",
	"fileimporter-api-nopagesreturned": "Error message when the remote API returns no pages.",
	"fileimporter-api-toomanyrevisions": "Error message when the import target has too many revisions..",
	"fileimporter-cantparseurl": "Error message shown on the special page when the URL entered can not be parsed.",
	"fileimporter-cantimporturl": "Error message shown on the special page when the URL entered can not be imported from.",
	"fileimporter-cantimportfromsharedrepo": "Error message when the file import target comes from a shared or remote repository.",
	"fileimporter-cantimportmissingfile": "Error message when the file import target is missing.",
	"fileimporter-badtoken": "Error message shown on the special page when the CSRF token for the request does not match the expected token.",
	"fileimporter-badimporthash": "Error message shown on the special page when the import hash for the request does not match the expected hash.",
	"fileimporter-filenameerror-default" : "Error message shown on the special page when the file name to be imported to has an issue we have no special handling for.",
	"fileimporter-filenameerror-illegal" : "Error message shown on the special page when the file name to be imported to is reported as invalid by MediaWiki.",
	"fileimporter-filenameerror-toolong" : "Error message shown on the special page when the file name to be imported to is reported as too long by MediaWiki.",
	"fileimporter-localtitleexists": "Error message shown on the special page when the title to be imported to already exists on the local wiki.",
	"fileimporter-sourcetitleexists": "Error message shown on the special page when the title to be imported to already exists on the source wiki.",
	"fileimporter-illegalfilenamechars" : "Error message shown on the special page when the title to be imported to contains invalid characters as defined by MediaWiki.",
	"fileimporter-duplicatefilesdetected": "Error message shown on the special page when the file to be imported has been detected as already existing on the local wiki.",
	"fileimporter-duplicatefilesdetected-prefix": "Prefix for the duplicate file that has been found.\n{{Identical|Duplicate}}",
	"fileimporter-exampleprefix": "Prefix for the example URL contained within the URL text box on the special page.\n{{Identical|Example}}",
	"fileimporter-textrevisions": "Prefix for the number of text revisions to be imported on the special page.",
	"fileimporter-submit": "Text for the submit button on the special page.\n{{Identical|Submit}}",
	"fileimporter-resubmit": "Text for the resubmit button on the special page.",
	"fileimporter-import": "Text for the import button on the special page.\n{{Identical|Import}}",
	"fileimporter-cancel": "Text for the cancel button on the special page.\n{{Identical|Cancel}}",
	"fileimporter-imported": "Note shown at the top of the successful import page.",
	"fileimporter-edittitle": "Text for the button allowing a user to edit the file title for import.",
	"fileimporter-editinfo": "Text for the button allowing a user to edit the file info for import.",
	"fileimporter-extensionlabel": "Label for the display of the file extension.",
	"fileimporter-newfilename": "Label for the new file name input box.",
	"fileimporter-newfilename-placeholder": "Placeholder for the file name input box.",
	"fileimporter-editsummary": "Label for the edit summary input box.\n{{Identical|Edit summary}}",
	"fileimporter-editsummary-placeholder": "Placeholder for the edit summary input box.",
	"fileimporter-previewnote": "Note shown at the top of the import page.",
	"fileimporter-heading-fileinfo": "Heading of the file info on the import page.",
	"fileimporter-heading-filehistory": "Heading of the file history on the import page.",
	"fileimporter-revision-removed-text": "Text inserted if the original text is suppressed.",
	"fileimporter-revision-removed-comment": "Text inserted as a revision comment if the original comment is suppressed."
}
